rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."director" IS NULL
---
 def find
    id = params[:id]
    m = Movie.find_movies_same_director(id)